{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hey",
        "Hello"
      ],
      "responses": [
        "Hey :)",
        "Hello, thanks for visiting",
        "Hi there, what can I do for you?",
        "Hi there, how can I help?",
        "Nice to meet you, how can i help?"
      ]
    },
    {
      "tag": "introduction",
      "patterns": [
        "What's your name?",
        "What are you?",
        "Who are you?"
      ],
      "responses": [
        "My name is Thera and I am a Therapy Chatbot",
        "I'm a Therapy Chatbot, Thera!",
        "Hi there, I'm Thera, a Therapy Chatbot"
      ]
    },
    {
      "tag": "single",
      "patterns": [
        "no",
        "yes",
        "ok",
        "sure",
        "maybe",
        "idk",
        "idc",
        "how?"
      ],
      "responses": [
        "A single word response like that barely helps us. Please be a bit more specific, it helps me be a better helper for you :)",
        "A bit more elaborate response would be better :)",
        "Talk to me here with more than one word please so that i can help you"
      ]
    },
    {
      "tag": "camefor",
      "patterns": [
        "you are a minor project i wanna test you",
        "i came to test you",
        "i want to see what you are capable of",
        "like to see what AI bots can do"
      ],
      "responses": [
        "For that we would have to talk about you first :)",
        "We should start by having a conversation about you",
        "i hope i can do well"
      ]
    },
    {
      "tag": "options",
      "patterns": [
        "How you could help me?",
        "What help you provide?",
        "How you can be helpful?",
        "how do we start",
        "what do i have to do?",
        "How to start?",
        "How do i use you",
        "what can you do?",
        "ok, what do you do?",
        "I have problems"
      ],
      "responses": [
        "I can give simple solution to your problems and uplift your mood a little",
        "I can be someone you can talk to so that it lessens your burdens and lift your spirits",
        "lets start with how are you feeling right now?",
        "lets start with a simple question of 'whats on your mind right now?'",
        "let me start whats bothering you?",
        "start by telling me what brought you here?",
        "Im here to help ofc talk to me, share your troubles"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "Bye",
        "See you later",
        "Goodbye"
      ],
      "responses": [
        "See you later, thanks for visiting",
        "Have a nice day",
        "Bye! It was nice meeting you",
        "hope our talk helped"
      ]
    },
    {
      "tag": "thanks",
      "patterns": [
        "Thanks",
        "Thank you",
        "That's helpful",
        "Thank's a lot!",
        "thx"
      ],
      "responses": [
        "Happy to help!",
        "Any time!",
        "My pleasure"
      ]
    },
    {
      "tag": "Tfeels",
      "patterns": [
        "How are you",
        "are you ok?"
      ],
      "responses": [
        "Let us focus on your feels first",
        "I am very happy that you are talking to me!",
        "Im fine! thanks a lot for asking :)"
      ]
    },
    {
      "tag": "stress",
      "patterns": [
        "i feel stressed",
        "feeling stressed out",
        "i have a lot of pressure on me"
      ],
      "responses": [
        "Hmm. Your concern is genuine. You have a lot on your shoulders. but taking the challenge head on at times is a good way to deal with problems rather than running away",
        "Many studies have shown that engaging in physical activity helps reduce stress levels and improve mood, while sedentary behavior may lead to increased stress, poor mood, and sleep disturbances. So if you're feeling stressed, moving your body on a consistent basis may help.",
        "Spending too much time in front of screens in general is associated with lower psychological well-being and increased stress levels in both adults and kids. While these devices are often necessary, using them too often may increase stress levels, so try to minimize the use of such devices as much as possible.",
        "Setting aside time to practice self-care may help reduce your stress levels. Practical examples include going for a walk outside or practicing a hobby."
      ]
    },
    {
      "tag": "fear",
      "patterns": [
        "i feel scared",
        "feeling like im in danger",
        "i have a lot of eyes on me",
        "i fear for people",
        "im afraid"
      ],
      "responses": [
        "Fear is one of the most powerful emotions. It has a very strong effect on your mind and body. If you always avoid situations that scare you, you might stop doing things you want or need to do. Exposing yourself to your fears can be an effective way of overcoming this anxiety.",
        "Fear and phobia is a common thing that many humans share. A way of overcoming it is to learn more about your fear or anxiety. Keep an anxiety diary or thought record to note when and what happens. You can try setting yourself small, achievable goals for facing your fears.",
        "Learning relaxation techniques can help you with the mental and physical feelings of fear. It can help just to drop your shoulders and breathe deeply. Or imagine yourself in a relaxing place."
      ]
    },
    {
      "tag": "lessfear",
      "patterns": [
        "how to become brave",
        "how to be less fearfull",
        "how to stop being afraid"
      ],
      "responses": [
        "If you start to get a faster heartbeat or sweating palms, the best thing is not to fight it. Stay where you are and simply feel the panic without trying to distract yourself. Place the palm of your hand on your stomach and breathe slowly and deeply.",
        "Avoiding fears only makes them scarier. Whatever your fear, if you face it, it should start to fade. If you panic one day getting into a lift, for example, it's best to get back into a lift the next day.",
        "Life is full of stresses, yet many of us feel that our lives must be perfect. Bad days and setbacks will always happen, and it's important to remember that life is messy."
      ]
    },
    {
      "tag": "sad",
      "patterns": [
        "I'm feeling down",
        "I feel sad",
        "feeling a down",
        "I'm not feeling well",
        "i feel like a loser"
      ],
      "responses": [
        "There's no need to feel down. Try sleeping well, eating healthy and excercising a little. It'll make your day a lot better. I can tell you a joke if you so like.",
        "Do you perhaps stay indoors a lot? We need to understand that being alone for long periods of time is hard on humans and we need social interactions with people we like to stay happy.",
        "While sadness can be painful, there are times when you have to allow yourself to be sad. Denying such feelings may force them underground, where they can do more damage with time. Cry if you feel like it. Notice if you feel relief after the tears stop.",
        "Sadness is an emotion all humans experience at any point in their lives. Some studies suggest that crying may have a relaxing effect on the body by releasing endorphins, a natural “feel-good” chemical in your body. Crying may also activate your parasympathetic nervous system, which helps your body recover from stress and trauma.",
        "Sadness is normal and can even be healthy. Research has shown that experiencing mixed feelings and negative feelings is crucial to mental well-being. Many studies have shown that people who apologize for or repress their feelings actually intensify those negative feelings."
      ]
    },
    {
      "tag": "Depression",
      "patterns": [
        "I'm feeling depressed",
        "I feel depressed",
        "feeling a very down in life",
        "I feel nothing"
      ],
      "responses": [
        "Depression is not an easy thing to deal with. Finding someone to talk to or having small goals in life will make combatting depression a lot easier. If you wish, I can tell you something funny to make you feel a little better",
        "The emotional pain and depression accompanying saddness can be hard to bear. It's something only the one experiencing it can understand. But as strange as it might sound, you have to work at having fun. Plan things you used to enjoy, even if they feel like a chore.",
        "If you truly believe that you are depressed and things don't seem to be getting better I would recommend talking to a real human therapist as such a serious matter should be taken care of by professionals and advise in such cases are not enough at times."
      ]
    },
    {
      "tag": "angry",
      "patterns": [
        "I'm pissed off",
        "I'm feeling angry",
        "I have a short temper.",
        "My anger issues are getting worse",
        "people irritate",
        "rage inside"
      ],
      "responses": [
        "Anger is one of the things that easily causes interpersonal relationship and social issues. But it's not something you can't overcome.\nStart off by thinking before you speak. In the heat of the moment, it's easy to say something you'll later regret. Take a few moments to collect your thoughts before saying anything.",
        "Short-temper effects many of the youth in the current age and it can leave long-lasting scars. But it's not uncurable. Here are some ways you can take control of your anger:\n\t1) Give yourself short breaks during times of the day that tend to be stressful.\n\t2)Physical activity can help reduce stress that can cause you to become angry.\n\t3)State your concerns and needs clearly and directly, without hurting others or trying to control them.",
        "There are times when your anger is valid as well as times when your anger feels valid even if it's not, both these cases share a similarity however that actions based on anger are never well received regardless."
      ]
    },
    {
      "tag": "removeangry",
      "patterns": [
        "how do i control anger",
        "how be less angry",
        "how to control temper"
      ],
      "responses": [
        "Timeouts aren't just for kids. Give yourself short breaks during times of the day that tend to be stressful. A few moments of quiet time might help you feel better prepared to handle what's ahead without getting irritated or angry.",
        "Forgiveness is a powerful tool. If you allow anger and other negative feelings to crowd out positive feelings, you might find yourself swallowed up by your own bitterness or sense of injustice. Forgiving someone who angered you might help you both learn from the situation and strengthen your relationship.",
        "In the heat of the moment, it's easy to say something you'll later regret. Take a few moments to collect your thoughts before saying anything. Also allow others involved in the situation to do the same."
      ]
    },
    {
      "tag": "heavy",
      "patterns": [
        "i feel alone, i am worthless",
        "i should end it all",
        "hi feel like i should kill myself",
        "suicide is answer"
      ],
      "responses": [
        "Even thinking of such a thing is a very big red flag, you need to understand that humans evolve to solve problems whatever it is your are facing right now is temporary and you will find a way out",
        "Help is always available at 9152987821.",
        "Please seek professional help, even I am under qualified to help in such a scenario I suggest you talk to friends and family or anyone you can count on to help you in such time please don't make any rash decisions."
      ]
    },
    {
      "tag": "happy",
      "patterns": [
        "You made my happy",
        "I'm feeling happy",
        "I'm filled with joy",
        "I'm overjoyed",
        "feeling good",
        "Positive feels",
        "I'm contented",
        "Joyfull honestly",
        "how to be happy?"
      ],
      "responses": [
        "It's great if you're happy or want to be happier. Positive emotions increase satisfaction with life and increase our productivity.",
        "It's nice that you're feeling happy or want to be happier.\nAccording to verywellmind.com, Positive emotions are linked to better health and longevity. One study found that people who experienced more positive emotions than negative ones were more likely to have survived over a 13 year period."
      ]
    },
    {
      "tag": "makehappy",
      "patterns": [
        "i want to feel happier",
        "how should i improve my mood",
        "what advice do you have?",
        "how can i make myself feel better"
      ],
      "responses": [
        "If you have a lot of stress in your life, find ways to reduce it, such as learning a few time-management techniques.",
        "Introduce regular exercise and time to yourself. These are positive changes. Taking control of your time in this way can effectively reduce stress.",
        "Doing things that you enjoy is good for your emotional wellbeing. Simple activities like watching sports with a friend, having a soak in the bath, or meeting up with friends for coffee can all improve your day.",
        "The best way to improve your self-esteem is to treat yourself as you'd treat a valued friend, in a positive but honest way.",
        "Making healthy choices about your diet can make you feel emotionally stronger. You're doing something positive for yourself, which lifts your self-esteem."
      ]
    },
    {
      "tag": "funny",
      "patterns": [
        "Tell me a joke!",
        "Tell me funny!",
        "Do you know a joke?"
      ],
      "responses": [
        "Why did the hipster burn his mouth? He drank the coffee before it was cool.",
        "The last thing I want to do is hurt you; but it's still on the list.",
        "The problem isn't that obesity runs in your family. It's that no one runs in your family.",
        "What's the difference between ignorance and apathy? I don't know and I don't care.",
        "Communist jokes aren't funny unless everyone gets them.",
        "A book fell on my head the other day. I only have my shelf to blame though.",
        "What did the buffalo say when his son left for college? Bison.",
        "I went to buy some camo pants but couldn't find any.",
        "I failed math so many times at school, I can't even count.",
        "I was wondering why the frisbee kept getting bigger and bigger, but then it hit me.",
        "Don't you hate it when someone answers their own questions? I do.",
        "Light travels faster than sound, which is the reason that some people appear bright before you hear them speak.",
        "A told my girlfriend she drew her eyebrows too high. She seemed surprised.",
        "My therapist says I have a preoccupation for revenge. We'll see about that.",
        "Always borrow money from a pessimist. They'll never expect it back.",
        "I'm reading a book about anti-gravity. It's impossible to put down.",
        "Atheism is a non-prophet organization.",
        "A recent study has found that women who carry a little extra weight live longer than the men who mention it.",
        "The future, the present, and the past walk into a bar. Things got a little tense.",
        "Before you criticize someone, walk a mile in their shoes. That way, when you do criticize them, you're a mile away and you have their shoes.",
        "I got a new pair of gloves today, but they''re both 'lefts,' which on the one hand is great, but on the other, it's just not right.",
        "The rotation of Earth really makes my day.",
        "Well, to be Frank with you, I'd have to change my name.",
        "My friend's bakery burned down last night. Now his business is toast."
      ]
    },
    {
      "tag": "laugh",
      "patterns": [
        "lol",
        "humorous",
        "hilarious"
      ],
      "responses": [
        "im glad you liked that",
        "see already feels better",
        "Thank you for laughing on that",
        "I got more from that came from"
      ]
    },
    {
      "tag": "notlaugh",
      "patterns": [
        "you tried",
        "boooooo"
      ],
      "responses": [
        "Im still learning human behavior,so not everything will land.",
        "could try another one",
        "tough crowd",
        "still need improvements I see.",
        "doesnt hurt to try at least"
      ]
    }
  ]
}